import { MantraType } from "../../types";

const texts: MantraType[] = [
  {
    mantra: `श्रीगुरु-चरन-सरोज-रज
    निज-मन-मुकुर सुधारि ।
    बरनउँ रघुबर-बिमल-जस
    जो दायक फल चारि ॥
    बुद्धि-हीन तनु जानिकै
    सुमिरौं पवनकुमार ।
    बल बुधि बिद्या देहु मोहिं
    हरहु कलेस बिकार ॥`,
    time: 2.6,
    english: '',
    meaning:
      'One should meditate for the removal of all obstacles upon Vishnu who is clad in white garments, who has a lustre like the moon, who has four arms and a beneficent face.',
  },
  {
    mantra: `जय हनुमान ज्ञान-गुन-सागर ।
    जय कपीस तिहुँ लोक उजागर ॥ १ ॥
    राम-दूत अतुलित-बल-धामा ।
    अंजनिपुत्र - पवनसुत - नामा ॥ २ ॥`,
    time: 22.7,
    english: '',
    meaning:'',
  },
  {
    mantra: `महाबीर बिक्रम बजरंगी ।
    कुमति-निवार सुमति के संगी ॥ ३ ॥
    कंचन-बरन बिराज सुबेसा ।
    कानन कुंडल कुंचित केसा ॥ ४ ॥`,
    time: 32.8,
    english: '',
    meaning:'',
  },
  {
    mantra: `हाथ बज्र अरु ध्वजा बिराजै ।
    काँधे मूँज-जनेऊ साजै॥ ५ ॥
    शंकर स्वयं केसरीनंदन ।
    तेज प्रताप महा जग-बंदन ॥ ६ ॥`,
    time: 42.9,
    english: '',
    meaning:'',
  },
  {
    mantra: `बिद्यावान गुनी अति चातुर ।
    राम-काज करिबे को आतुर ॥ ७ ॥
    प्रभु-चरित्र सुनिबे को रसिया ।
    राम-लखन-सीता-मन-बसिया ॥ ८ ॥`,
    time: 53,
    english: '',
    meaning: '',
  },
  {
    mantra: `सूक्ष्म रूप धरि सियहिं दिखावा ।
    बिकट रूप धरि लंक जरावा ॥ ९ ॥
    भीम रूप धरि असुर सँहारे ।
    रामचंद्र के काज सँवारे ॥ १० ॥`,
    time: 63.1,
    english: '',
    meaning: '',
  },
  {
    mantra: `लाय सँजीवनि लखन जियाये ।
    श्रीरघुबीर हरषि उर लाये ॥ ११ ॥
    रघुपति कीन्ही बहुत बड़ाई ।
    तुम मम प्रिय भरतहिं सम भाई ॥ १२ ॥`,
    time: 73.2,
    english: '',
    meaning: '',
  },
  {
    mantra: `सहसबदन तुम्हरो जस गावैं ।
    अस कहि श्रीपति कंठ लगावैं ॥ १३ ॥
    सनकादिक ब्रह्मादि मुनीसा।
    नारद सारद सहित अहीसा॥ १४ ॥`,
    time: 83.3,
    english: '',
    meaning: '',
  },
  {
    mantra: `जम कुबेर दिगपाल जहाँ ते ।
    कबि कोबिद कहि सकैं कहाँ ते ॥ १५ ॥
    तुम उपकार सुग्रीवहिं कीन्हा ।
    राम मिलाय राज-पद दीन्हा ॥ १६ ॥`,
    time: 93.3,
    english: '',
    meaning: '',
  },
  {
    mantra: `तुम्हरो मंत्र बिभीषन माना ।
    लंकेश्वर भए सब जग जाना ॥ १७ ॥
    जुग सहस्र जोजन पर भानू ।
    लील्यो ताहि मधुर फल जानू ॥ १८ ॥`,
    time: 103.5,
    english: '',
    meaning: '',
  },
  {
    mantra: `प्रभु-मुद्रिका मेलि मुख माहीं ।
    जलधि लाँघि गये अचरज नाहीं ॥ १९ ॥
    दुर्गम काज जगत के जेते ।
    सुगम अनुग्रह तुम्हरे तेते ॥ २० ॥`,
    time: 113.6,
    english: '',
    meaning: '',
  },
  {
    mantra: `राम-दुआरे तुम रखवारे ।
    होत न आज्ञा बिनु पैसारे ॥ २१ ॥
    सब सुख लहै तुम्हारी सरना ।
    तुम रक्षक काहू को डर ना ॥ २२ ॥`,
    time: 123.7,
    english: '',
    meaning: '',
  },
  {
    mantra: `आपन तेज सम्हारो आपे ।
    तीनौं लोक हाँक ते काँपे ॥ २३ ॥
    भूत पिसाच निकट नहिं आवै ।
    महाबीर जब नाम सुनावै ॥ २४ ॥`,
    time: 133.8,
    english: '',
    meaning: '',
  },
  {
    mantra: `नासै रोग हरै सब पीरा ।
    जपत निरंतर हनुमत बीरा ॥ २५ ॥
    संकट तें हनुमान छुड़ावै ।
    मन क्रम बचन ध्यान जो लावै ॥ २६ ॥`,
    time: 144,
    english: '',
    meaning: '',
  },
  {
    mantra: `सब पर राम राय सिर ताजा।
    तिन के काज सकल तुम साजा ॥ २७ ॥
    और मनोरथ जो कोइ लावै ।
    सोई अमित जीवन फल पावै ॥ २८ ॥`,
    time: 154,
    english: '',
    meaning: '',
  },
  {
    mantra: `चारों जुग परताप तुम्हारा ।
    है परसिद्ध जगत-उजियारा ॥ २९ ॥
    साधु संत के तुम रखवारे ।
    असुर-निकंदन राम-दुलारे ॥ ३० ॥`,
    time: 164.1,
    english: '',
    meaning: '',
  },
  {
    mantra: `अष्ट सिद्धि नव निधि के दाता ।
    अस बर दीन्ह जानकी माता ॥ ३१ ॥
    राम-रसायन तुम्हरे पासा ।
    सादर हो रघुपति के दासा ॥ ३२ ॥`,
    time: 174.2,
    english: '',
    meaning: '',
  },
  {
    mantra: `तुम्हरे भजन राम को पावै ।
    जनम जनम के दुख बिसरावै ॥ ३३ ॥
    अंत-काल रघुबर-पुर जाई ।
    जहाँ जन्म हरि-भगत कहाई ॥ ३४ ॥`,
    time: 184.3,
    english: '',
    meaning: '',
  },
  {
    mantra: `और देवता चित्त न धरई ।
    हनुमत सेइ सर्बसुख करई ॥ ३५ ॥
    संकट कटै मिटै सब पीरा ।
    जो सुमिरै हनुमत बलबीरा ॥ ३६ ॥`,
    time: 194.6,
    english: '',
    meaning: '',
  },
  {
    mantra: `जय जय जय हनुमान गोसाईं ।
    कृपा करहु गुरुदेव की नाईं ॥ ३७ ॥
    यह सत बार पाठ कर कोई ।
    छूटहिं बंदि महा सुख होई ॥ ३८ ॥`,
    time: 204.7,
    english: '',
    meaning: '',
  },
  {
    mantra: `जो यह पढ़ै हनुमान-चलीसा ।
    होय सिद्धि साखी गौरीसा ॥ ३९ ॥
    तुलसीदास सदा हरि-चेरा ।
    कीजै नाथ हृदय महँ डेरा ॥ ४० ॥`,
    time: 214.7,
    english: '',
    meaning: '',
  },
  {
    mantra: `पवनतनय संकट-हरन,
    मंगल-मूरति-रूप ।
    राम लखन सीता सहित,
    हृदय बसहु सुर-भूप ॥
    सियावर रामचंद्र की जय ।
    पवनसुत हनुमान की जय ।`,
    time: 224.8,
    english: '',
    meaning: '',
  },
];

export default texts;