import { MantraType } from "../../types";

const texts: MantraType[] = [
  {
    mantra: `जटा टवी गलज्जल - जल - प्रवाह - पावितस्थले
गलेऽवलम्ब्य लम्बितां भुजंग - तुङ्ग - मालिकाम्।
डमड् - डमड् - डमड् - डमन् - निनाद - वड् - डमर्वयं
चकार चण्ड - ताण्डवं तनोतु नः शिवः शिवम्।।१।।

जटाटवीगलज्जलप्रवाहपावितस्थले
गलेऽवलम्ब्य लम्बितां भुजङ्गतुङ्गमालिकाम्।
डमड्डमड्डमड्डमन्निनादवड्डमर्वयं
चकार चण्डताण्डवं तनोतु नः शिवः शिवम्॥१॥`,
    time: 106.8,
    english: "",
    meaning: "",
  },
  {
    mantra: `जटा - कटाह - सम्भ्रम - भ्रमन् - निलिम्पनिर्झरी
विलोल् - वीचिवल्लरी- विराज - मानमूर्धनि ।
धगद् - धगद् - धगज् - ज्वलल् ललाट - पट्टपावके
किशोर - चन्द्र - शेखरे रतिः प्रतिक्षणं मम ||२||

जटाकटाहसंभ्रम भ्रमन्निलिम्पनिर्झरी
विलोलवीचिवल्लरी विराजमानमूर्धनि।
धगद्धगद्धगज्ज्वलल्ललाटपट्टपावके
किशोरचन्द्रशेखरे रतिः प्रतिक्षणं मम॥`,
    time: 168.7,
    english: "",
    meaning: ``,
  },
  {
    mantra: `धरा - धरेन्द्र - नन्दिनी - विलास - बन्धुबन्धुर -
स्फुरद् - दिगन्त - सन्तति - प्रमोद - मानमानसे
कृपा - कटाक्ष - धोरणी - निरुद्ध - दुर्धरापदि
क्वचिद् - दिगम्बरे मनो विनोद- मेतुवस्तुनि ।।३।।

धराधरेन्द्रनन्दिनी विलासबन्धुबन्धुर
स्फुरद्दिगन्तसन्तति प्रमोदमानमानसे।
कृपाकटाक्षधोरणी निरुद्धदुर्धरापदि
क्वचिद्दिगम्बरे मनो विनोदमेतु वस्तुनि ।।३।।`,
    time: 233.4,
    english: "",
    meaning: ``,
  },
  {
    mantra: `जटा - भुजङ्ग पिङ्गल - स्फुरत् - फणामणि - प्रभा
कदम्ब कुङ्कुम - द्रव - प्रलिप्त - दिग्वधू - मुखे ।
मदान्ध - सिन्धुर - स्फुरत् - त्वगुत्त - रीय - मेदुरे
मनो विनोद मद्भुतं बिभर्तु भूत - भर्तरि ।।४ ।।

जटाभुजङ्गपिङ्गल स्फुरत्फणामणिप्रभा
कदम्बकुङ्कुमद्रवप्रलिप्तदिग्वधूमुखे।
मदान्धसिन्धुरस्फुरत्त्वगुत्तरीयमेदुरे
मनो विनोदमद्भुतं बिभर्तु भूतभर्तरि ॥4॥`,
    time: 296,
    english: "",
    meaning: ``,
  },
  {
    mantra: `सहस्र - लोचन - प्रभृत्य शेष लेख - शेखर
प्रसून धूलि - धोरणी विधू - सराङ्घ्रि - पीठभूः ।
भुजङ्ग - राज - मालया निबद्ध - जाट - जूटक :
श्रियै चिराय जायतां चकोर -- बन्धु - शेखरः ।।५ ।।

सहस्रलोचनप्रभृत्यशेषलेखशेखर
प्रसूनधूलिधोरणी विधूसराङ्घ्रिपीठभूः।
भुजङ्गराजमालया निबद्धजाटजूटकः
श्रियै चिराय जायतां चकोरबन्धुशेखरः॥५॥`,
    time: 358,
    english: "",
    meaning: ``,
  },
  {
    mantra: `ललाट - चत्वर - ज्वलद् धनञ्जय - स्फुलिङ्गभा
निपीत पञ्च - सायकं नमन् - निलिम्प नायकमू ।
सुधा मयूख - लेखया विराज - मान - शेखरं
महा - कपालि सम्पदे शिरो जटाल - मस्तुनः ।।६ ।।

ललाटचत्वरज्वलद्धनञ्जयस्फुलिङ्गभा
निपीतपञ्चसायकं नमन्निलिम्पनायकम्।
सुधामयूखलेखया विराजमानशेखरं
महाकपालिसम्पदे शिरोजटालमस्तु नः ॥६॥`,
    time: 418.2,
    english: "",
    meaning: ``,
  },
  {
    mantra: `कराल - भाल - पट्टिका - धगद् धगद् धगज्ज्वलद्
धनञ्जया - हुती - कृत - प्रचण्ड पञ्च - सायके ।
धरा - धरेन्द्र - नन्दिनी - कुचाग्र - चित्र - पत्रक
प्रकल्प - नैक - शिल्पिनि त्रिलोचने रतिर्मम ।।७ ।।

करालभालपट्टिकाधगद्धगद्धगज्ज्वल
द्धनञ्जयाहुतीकृत प्रचण्डपञ्चसायके।
धराधरेन्द्रनन्दिनी कुचाग्रचित्रपत्रक
प्रकल्पनैकशिल्पिनी त्रिलोचने रतिर्मम ॥७॥`,
    time: 486.8,
    english: "",
    meaning: ``,
  },
  {
    mantra: `नवीन - मेघ - मण्डली - निरुद्ध दुर्धर - स्फुरत्
कुहू - निशीथिनी - तमः- प्रबन्ध - बद्ध कन्धरः ।
निलिम्पनिर्झरी - धरस् - तनोतु कृत्ति - सिन्धुरः
कला - निधान बन्धुरः श्रियं जगद्- धुरन्धरः ।।८ ।।

नवीनमेघमण्डली निरुद्धदुर्धरस्फुरत्
कुहूनिशीथिनीतमः प्रबन्धबद्धकन्धरः।
निलिम्पनिर्झरीधरस्तनोतु कृत्तिसिन्धुरः
कलानिधानबन्धुरः श्रियं जगद्धुरन्धरः ॥८॥`,
    time: 546.8,
    english: "",
    meaning: ``,
  },
  {
    mantra: `प्रफुल्ल - -नील - पङ्कज प्रपञ्च - कालिम - प्रभा
वलम्बि कण्ठ - कन्दली रुचि - प्रबद्ध कन्धरम् ।
स्मरच्छिदं पुरच्छिदं भवच्छिदं मखच्छिदं
गजच्छि - दान्ध - कच्छिदं तमन्त - कच्छिदंभजे ।। ९ ।।

प्रफुल्लनीलपङ्कज प्रपञ्चकालिमप्रभा
वलम्बिकण्ठकन्दली रुचिप्रबद्धकन्धरम्।
स्मरच्छिदं पुरच्छिदं भवच्छिदं मखच्छिदं
गजच्छिदान्धकच्छिदं तमन्तकच्छिदं भजे ॥९॥॥`,
    time: 609.5,
    english: "",
    meaning: ``,
  },
  {
    mantra: `अखर्व - सर्व - मङ्गला - कला - कदम्ब - मञ्जरी
रस- प्रवाह - माधुरी- विजृम्भणा मधु - व्रतम् ।
स्मरान्तकं पुरान्तकं भवान्तकं मखान्तकं
गजान्त - कान्ध - कान्तकं तमन्त - कान्तकंभजे ।।१० ।।

अखर्वसर्वमङ्गला कलाकदम्बमञ्जरी
रसप्रवाहमाधुरी विजृम्भणामधुव्रतम्।
स्मरान्तकं पुरान्तकं भवान्तकं मखान्तकं
गजान्तकान्धकान्तकं तमन्तकान्तकं भजे ॥१०॥`,
    time: 670,
    english: "",
    meaning: ``,
  },
  {
    mantra: `जयत् - वदभ्र - विभ्रम - भ्रमद् - भुजङ्गमश्वस
द्विनिर्गमत् - क्रम स्फुरत् - कराल भाल हव्य वाट्
धिमिद् - धिमिद् - धिमिद् - ध्वनन् - मृदङ्ग - तुङ्ग - मङ्गल
ध्वनि - क्रम- प्रवर्तित - प्रचण्ड - ताण्डवः शिवः ।।११ ।।

जयत्वदभ्रविभ्रमभ्रमद्भुजङ्गमस्फुर-
धिग्धिग्धि निर्गमत्कराल भाल हव्यवाट्।
धिमिद्धिमिद्धिमिद्ध्वनन्मृदङ्गतुङ्गमङ्गल-
ध्वनिक्रमप्रवर्तित प्रचण्डताण्डवः शिवः ॥११॥`,
    time: 733,
    english: "",
    meaning: ``,
  },
  {
    mantra: `दृषद् - विचित्र - तल्पयोर् - भुजङ्ग - मौक्ति - कस्रजोर्
गरिष्ठ - रत्न - लोष्ठयोः सुहृद् - विपक्ष - पक्ष - योः ।
तृणारविन्द - चक्षुषोः प्रजा - मही- महेन्द्रयोः
सम - प्रवृत्ति - कः कदा सदा - शिवंभजाम्यहम् ।।१२ ।।

दृषद्विचित्रतल्पयोर्भुजङ्गमौक्तिकस्रजोर्
गरिष्ठरत्नलोष्ठयोः सुहृद्विपक्षपक्षयोः।
तृणारविन्दचक्षुषोः प्रजामहीमहेन्द्रयोः
समं प्रवर्तयन्मनः कदा सदाशिवं भजे ॥१२॥`,
    time: 790.7,
    english: "",
    meaning: ``,
  },
  {
    mantra: `कदा निलिम्प - निर्झरी - निकुञ्जकोटरेवसन्
विमुक्त - दुर्मतिः सदा शिरःस्थ - मञ्जलिंवहन् ।
विलोल् - लोल् - लोचनो ललाम - भाल - लग्नकः
शिवेति मन्त्र मुच्चरन् कदा सुखीभवाम्यहम् ।।१३ ।।

कदा निलिम्पनिर्झरी निकुञ्जकोटरे वसन्
विमुक्तदुर्मतिः सदा शिरःस्थमञ्जलिं वहन्।
विलोललोचलो ललामभाललग्नकः
शिवेति मन्त्रमुच्चरन् कदा सुखी भवाम्यहम् ॥१३॥`,
    time: 851.8,
    english: "",
    meaning: ``,
  },
  {
    mantra: `इमं हि नित्य - मेव - मुक्त - मुत्त - मोत्तमस्तवं
पठन् स्मरन् ब्रुवन्नरो विशुद्ध - मेतिसन्ततम् ।
हरे गुरौ सुभक्ति - माशु याति नान्यथा गतिं
विमोहनं हि देहिनां सुशङ्करस्यचिन्तनम् ।। १४ ।।

इमं हि नित्यं एव मुक्तमुक्तमोत्तमं स्तवं
पठन्स्मरन् ब्रुवन्नरो विशुद्धिमेतिसंततम्।
हरे गुरौ सुभक्तिमाशु याति नान्यथा गतिं
विमोहनं हि देहिनां सुशङ्करस्य चिन्तनम् ॥१४॥`,
    time: 915.3,
    english: "",
    meaning: ``,
  },
  {
    mantra: `पूजा - वसान - समये दश - वक्त्र - गीतं
यः शम्भु - पूजन - परं पठति प्रदोषे ।
तस्य स्थिरां रथ - गजेन्द्र - तुरङ्ग - युक्तां
लक्ष्मी सदैव सुमुखिं प्रददाति शम्भुः ।। १५ ।।

पूजावसानसमये दशवक्त्रगीतं यः
शम्भुपूजनपरं पठति प्रदोषे ।
तस्य स्थिरां रथगजेन्द्रतुरङ्गयुक्तां
लक्ष्मीं सदैव सुमुखीं प्रददाति शम्भुः ॥१५॥`,
    time: 971.7,
    english: "",
    meaning: ``,
  },
];

export default texts;
