const names = [
  `शुक्लाम्बरधरं विष्णुं शशिवर्णं चतुर्भुजम् ।
प्रसन्नवदनं ध्यायेत् सर्वविघ्नोपशान्तये ॥ १॥`,

  //   `यस्य द्विरदवक्त्राद्याः पारिषद्याः परः शतम् ।
  // विघ्नं निघ्नन्ति सततं विष्वक्सेनं तमाश्रये ॥ २॥`,

  `व्यासं वसिष्ठनप्तारं शक्तेः पौत्रमकल्मषम् ।
पराशरात्मजं वन्दे शुकतातं तपोनिधिम् ॥ ३॥`,

  `व्यासाय विष्णुरूपाय व्यासरूपाय विष्णवे ।
नमो वै ब्रह्मनिधये वासिष्ठाय नमो नमः ॥ ४॥`,

  `अविकाराय शुद्धाय नित्याय परमात्मने ।
सदैकरूपरूपाय विष्णवे सर्वजिष्णवे ॥ ५॥`,

  `यस्य स्मरणमात्रेण जन्मसंसारबन्धनात् ।
विमुच्यते नमस्तस्मै विष्णवे प्रभविष्णवे ॥ ६॥
ॐ नमो विष्णवे प्रभविष्णवे ।`,

  `श्रीवैशम्पायन उवाच ---
श्रुत्वा धर्मानशेषेण पावनानि च सर्वशः ।
युधिष्ठिरः शान्तनवं पुनरेवाभ्यभाषत ॥ ७॥`,

  `युधिष्ठिर उवाच ---
किमेकं दैवतं लोके किं वाप्येकं परायणम् ।
स्तुवन्तः कं कमर्चन्तः प्राप्नुयुर्मानवाः शुभम् ॥ ८॥`,

  `को धर्मः सर्वधर्माणां भवतः परमो मतः ।
किं जपन्मुच्यते जन्तुर्जन्मसंसारबन्धनात् ॥ ९॥`,

  `भीष्म उवाच ---
जगत्प्रभुं देवदेवमनन्तं पुरुषोत्तमम् ।
स्तुवन् नामसहस्रेण पुरुषः सततोत्थितः ॥ १०॥`,
];

const timeStamps = [52, 61, 70, 79.5, 88.5, 102, 114.5, 127, 137];

export { names, timeStamps };
